# SQL Introduction Exercise: TMDb Database
#### © Explore Data Science Academy

## Instructions

This project was carried out to show understanding of SQL views

As a result of several changes made to the underlying dataset, it is important to run the SQL queries below if at any point it is necessary to reset the changes

```SQL
DROP VIEW Customer_Germany;
DROP VIEW Customer_Support_View;
DROP VIEW Customer_View;
DROP VIEW Customer_per_Country_View;
DROP VIEW Employee_View;
DROP VIEW Support_Person_Stats;
```

### An overview of the database

In [1]:
#Load the SQL extension to use magic commands.
%load_ext sql

In [2]:
%sql sqlite:///data/chinook.db

%%sql

DROP VIEW Customer_Germany;
DROP VIEW Customer_Support_View;
DROP VIEW Customer_View;
DROP VIEW Customer_per_Country_View;
DROP VIEW Employee_View;
DROP VIEW Support_Person_Stats;
DROP VIEW Billing_View;
DROP VIEW Billing_View_per_Country;
DROP VIEW Customer_Billing_2013_View;
DROP VIEW Customer_Billing_View;
DROP VIEW Customer_Per_Country_View;
DROP VIEW Customer_Support_View;
DROP VIEW Customer_View;
DROP VIEW Employee_View;
DROP VIEW Support_Person_Stats;
DROP VIEW Yearly_Billing;

#### Tables in the database

In [3]:
%%sql

SELECT name
FROM sqlite_master

WHERE type IN ('table','view')

AND name NOT LIKE 'sqlite_%'

ORDER BY 1

 * sqlite:///data/chinook.db
Done.

[('Billing_View',),
 ('Customer_Billing_View',),
 ('Yearly_Billing',),
 ('albums',),
 ('artists',),
 ('customers',),
 ('employees',),
 ('genres',),
 ('invoice_items',),
 ('invoices',),
 ('media_types',),
 ('playlist_track',),
 ('playlists',),
 ('tracks',)]

**A quick look at some tables of the database**

In [4]:
%%sql

SELECT * FROM Employees
LIMIT 5;

 * sqlite:///data/chinook.db
Done.

[(1, 'Adams', 'Andrew', 'General Manager', None, '1962-02-18 00:00:00', '2002-08-14 00:00:00', '11120 Jasper Ave NW', 'Edmonton', 'AB', 'Canada', 'T5K 2N1', '+1 (780) 428-9482', '+1 (780) 428-3457', 'andrew@chinookcorp.com'),
 (2, 'Edwards', 'Nancy', 'Sales Manager', 1, '1958-12-08 00:00:00', '2002-05-01 00:00:00', '825 8 Ave SW', 'Calgary', 'AB', 'Canada', 'T2P 2T3', '+1 (403) 262-3443', '+1 (403) 262-3322', 'nancy@chinookcorp.com'),
 (3, 'Peacock', 'Jane', 'Sales Support Agent', 2, '1973-08-29 00:00:00', '2002-04-01 00:00:00', '1111 6 Ave SW', 'Calgary', 'AB', 'Canada', 'T2P 5M5', '+1 (403) 262-3443', '+1 (403) 262-6712', 'jane@chinookcorp.com'),
 (4, 'Park', 'Margaret', 'Sales Support Agent', 2, '1947-09-19 00:00:00', '2003-05-03 00:00:00', '683 10 Street SW', 'Calgary', 'AB', 'Canada', 'T2P 5G3', '+1 (403) 263-4423', '+1 (403) 263-4289', 'margaret@chinookcorp.com'),
 (5, 'Johnson', 'Steve', 'Sales Support Agent', 2, '1965-03-03 00:00:00', '2003-10-17 00:00:00', '7727B 41 Ave', 'Calgary', 'AB', 'Canada', 'T3B 1Y7', '1 (780) 836-9987', '1 (780) 836-9543', 'steve@chinookcorp.com')]

In [5]:
%%sql

SELECT * FROM customers
LIMIT 5;

 * sqlite:///data/chinook.db
Done.

[(1, 'Luís', 'Gonçalves', 'Embraer - Empresa Brasileira de Aeronáutica S.A.', 'Av. Brigadeiro Faria Lima, 2170', 'São José dos Campos', 'SP', 'Brazil', '12227-000', '+55 (12) 3923-5555', '+55 (12) 3923-5566', 'luisg@embraer.com.br', 3),
 (2, 'Leonie', 'Köhler', None, 'Theodor-Heuss-Straße 34', 'Stuttgart', None, 'Germany', '70174', '+49 0711 2842222', None, 'leonekohler@surfeu.de', 5),
 (3, 'François', 'Tremblay', None, '1498 rue Bélanger', 'Montréal', 'QC', 'Canada', 'H2G 1A7', '+1 (514) 721-4711', None, 'ftremblay@gmail.com', 3),
 (4, 'Bjørn', 'Hansen', None, 'Ullevålsveien 14', 'Oslo', None, 'Norway', '0171', '+47 22 44 22 22', None, 'bjorn.hansen@yahoo.no', 4),
 (5, 'František', 'Wichterlová', 'JetBrains s.r.o.', 'Klanova 9/506', 'Prague', None, 'Czech Republic', '14700', '+420 2 4172 5555', '+420 2 4172 5555', 'frantisekw@jetbrains.com', 4)]

In [6]:
%%sql

SELECT * FROM Invoice_items
LIMIT 10;

 * sqlite:///data/chinook.db
Done.

[(1, 1, 2, 0.99, 1),
 (2, 1, 4, 0.99, 1),
 (3, 2, 6, 0.99, 1),
 (4, 2, 8, 0.99, 1),
 (5, 2, 10, 0.99, 1),
 (6, 2, 12, 0.99, 1),
 (7, 3, 16, 0.99, 1),
 (8, 3, 20, 0.99, 1),
 (9, 3, 24, 0.99, 1),
 (10, 3, 28, 0.99, 1)]

In [7]:
%%sql

SELECT * FROM Invoices
LIMIT 5;

 * sqlite:///data/chinook.db
Done.

[(1, 2, '2009-01-01 00:00:00', 'Theodor-Heuss-Straße 34', 'Stuttgart', None, 'Germany', '70174', 1.98),
 (2, 4, '2009-01-02 00:00:00', 'Ullevålsveien 14', 'Oslo', None, 'Norway', '0171', 3.96),
 (3, 8, '2009-01-03 00:00:00', 'Grétrystraat 63', 'Brussels', None, 'Belgium', '1000', 5.94),
 (4, 14, '2009-01-06 00:00:00', '8210 111 ST NW', 'Edmonton', 'AB', 'Canada', 'T6G 2C7', 8.91),
 (5, 23, '2009-01-11 00:00:00', '69 Salem Street', 'Boston', 'MA', 'USA', '2113', 13.86)]

<br>
<br>

# Task 1 Description.

The manager needs to present details from the Chinook database to new clients. However, she is wary of releasing too much information. She has requested a few tasks to be completed using the "invoices" table, where all customer invoices need to be assessed:

## Task 1.1

**She would like to view the invoice date, billing city, billing country and the total spent on each invoice. The SQL query below set up a view called "Billing_View" to display these specific columns only.**

Creating **Billing_View**

In [8]:
%%sql

CREATE VIEW Billing_View AS
SELECT InvoiceDate, BillingCity, BillingCountry, Total
FROM Invoices

 * sqlite:///data/chinook.db
(sqlite3.OperationalError) view Billing_View already exists
[SQL: CREATE VIEW Billing_View AS
SELECT InvoiceDate, BillingCity, BillingCountry, Total
FROM Invoices]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

Displaying the content of the **Billing_View**

In [9]:
%%sql

SELECT *
FROM Billing_View
LIMIT 10;

 * sqlite:///data/chinook.db
Done.

[('2009-01-01 00:00:00', 'Stuttgart', 'Germany', 1.98),
 ('2009-01-02 00:00:00', 'Oslo', 'Norway', 3.96),
 ('2009-01-03 00:00:00', 'Brussels', 'Belgium', 5.94),
 ('2009-01-06 00:00:00', 'Edmonton', 'Canada', 8.91),
 ('2009-01-11 00:00:00', 'Boston', 'USA', 13.86),
 ('2009-01-19 00:00:00', 'Frankfurt', 'Germany', 0.99),
 ('2009-02-01 00:00:00', 'Berlin', 'Germany', 1.98),
 ('2009-02-01 00:00:00', 'Paris', 'France', 1.98),
 ('2009-02-02 00:00:00', 'Bordeaux', 'France', 3.96),
 ('2009-02-03 00:00:00', 'Dublin', 'Ireland', 5.94)]

Dropping the created **Billing_View.**

In [10]:
%%sql

DROP VIEW Billing_View_per_Country

 * sqlite:///data/chinook.db
(sqlite3.OperationalError) no such view: Billing_View_per_Country
[SQL: DROP VIEW Billing_View_per_Country]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

<br>
<br>

## Task 1.2

**She then needs to get a view on the average spending for each country. She only wants to see the billing country and the aggregated average total amount spent. Set up a view called "Billing_View_per_Country" to display these averages.**

Creating **Billing_View_per_Country**

In [11]:
%%sql

CREATE VIEW Billing_View_per_Country AS
SELECT BillingCountry, avg(Total) AS "Average_of_Total_Amount_Spent"
FROM Invoices
GROUP BY BillingCountry

 * sqlite:///data/chinook.db
Done.

[]

Displaying the content of **Billing_View_per_Country**

In [12]:
%%sql

SELECT *
FROM Billing_View_per_Country

 * sqlite:///data/chinook.db
Done.

[('Argentina', 5.3742857142857146),
 ('Australia', 5.3742857142857146),
 ('Austria', 6.088571428571428),
 ('Belgium', 5.374285714285714),
 ('Brazil', 5.431428571428571),
 ('Canada', 5.427857142857142),
 ('Chile', 6.659999999999999),
 ('Czech Republic', 6.445714285714287),
 ('Denmark', 5.3742857142857146),
 ('Finland', 5.945714285714287),
 ('France', 5.574285714285712),
 ('Germany', 5.588571428571428),
 ('Hungary', 6.517142857142857),
 ('India', 5.789230769230769),
 ('Ireland', 6.517142857142857),
 ('Italy', 5.3742857142857146),
 ('Netherlands', 5.8028571428571425),
 ('Norway', 5.659999999999999),
 ('Poland', 5.3742857142857146),
 ('Portugal', 5.517142857142856),
 ('Spain', 5.374285714285714),
 ('Sweden', 5.517142857142858),
 ('USA', 5.747912087912091),
 ('United Kingdom', 5.374285714285714)]

Dropping the created **Billing_View_per_Country.**

In [13]:
%%sql

DROP VIEW Billing_View_per_Country

 * sqlite:///data/chinook.db
Done.

[]

<br>
<br>

## Task 1.3

**She is also interested in seeing the most profitable years. She needs to see the years and the sum of the amount spent each year. Set up a view called "Yearly_Billing" to display the total spend for each year. HINT: use the "strftime" function to convert the invoice date.**

Creating the **Yearly_Billing** View

In [14]:
%%sql

CREATE VIEW Yearly_Billing AS
SELECT sum(Total), strftime('%Y', InvoiceDate) Year
FROM Invoices
GROUP BY [Year]

 * sqlite:///data/chinook.db
(sqlite3.OperationalError) view Yearly_Billing already exists
[SQL: CREATE VIEW Yearly_Billing AS
SELECT sum(Total), strftime('%Y', InvoiceDate) Year
FROM Invoices
GROUP BY [Year]]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

Displaying the contents of the **Yearly_Billing** View

In [15]:
%%sql

SELECT *
FROM Yearly_Billing

 * sqlite:///data/chinook.db
Done.

[(449.4600000000003, '2009'),
 (481.45000000000033, '2010'),
 (469.5800000000003, '2011'),
 (477.53000000000026, '2012'),
 (450.58000000000027, '2013')]

Dropping the **Yearly_Billing** View

In [16]:
%%sql

DROP Yearly_Billing

 * sqlite:///data/chinook.db
(sqlite3.OperationalError) near "Yearly_Billing": syntax error
[SQL: DROP Yearly_Billing]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

<br>
<br>

# Task 2 Description.

The manager is satisfied with the first set of views created - Horay!
<br>
Unfortunately, she would like to go into the more granular detail of the customers and their spending.
<br>
The final task requires to link the "customers" table with the "invoices" table. She has asked for the following views:

## Task 2.1

The billing country stated on the invoice, the total spent on the invoice, the last name of each customer, and their country of residence.
<br>
- This view should only have the billing country, total spent, last name of the customer and their country of residence as columns.
<br>
Call this view "Customer_Billing_View".

**Viewing the customer's table in the database**

In [17]:
%%sql

SELECT *
FROM Customers
LIMIT 1;

 * sqlite:///data/chinook.db
Done.

[(1, 'Luís', 'Gonçalves', 'Embraer - Empresa Brasileira de Aeronáutica S.A.', 'Av. Brigadeiro Faria Lima, 2170', 'São José dos Campos', 'SP', 'Brazil', '12227-000', '+55 (12) 3923-5555', '+55 (12) 3923-5566', 'luisg@embraer.com.br', 3)]

Creating the **Customer_Billing_View**

In [18]:
%%sql

CREATE VIEW Customer_Billing_View AS
SELECT c.LastName, c.Country, i.BillingCountry, i.Total
FROM Customers c
INNER JOIN Invoices i
ON c.CustomerId = i.CustomerId

 * sqlite:///data/chinook.db
(sqlite3.OperationalError) view Customer_Billing_View already exists
[SQL: CREATE VIEW Customer_Billing_View AS
SELECT c.LastName, c.Country, i.BillingCountry, i.Total
FROM Customers c
INNER JOIN Invoices i
ON c.CustomerId = i.CustomerId]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

Displaying the contents of the created **Customer_Billing_View**

In [19]:
%%sql

SELECT * 
FROM Customer_Billing_View
LIMIT 10;

 * sqlite:///data/chinook.db
Done.

[('Gonçalves', 'Brazil', 'Brazil', 3.98),
 ('Gonçalves', 'Brazil', 'Brazil', 3.96),
 ('Gonçalves', 'Brazil', 'Brazil', 5.94),
 ('Gonçalves', 'Brazil', 'Brazil', 0.99),
 ('Gonçalves', 'Brazil', 'Brazil', 1.98),
 ('Gonçalves', 'Brazil', 'Brazil', 13.86),
 ('Gonçalves', 'Brazil', 'Brazil', 8.91),
 ('Köhler', 'Germany', 'Germany', 1.98),
 ('Köhler', 'Germany', 'Germany', 13.86),
 ('Köhler', 'Germany', 'Germany', 8.91)]

Dropping the created **Customer_Billing_View**

<br>
<br>

## Task 2.2

The sum of the total amount spent by each customer in the latest year (2013). 
- The view should only contain the customers' surname, the sum of the total invoice amount and the year as columns. Call this view "Customer_Billing_2013_View". 
    
Hint: the invoice date column should be treated as a string; use the "strftime" function.

Creating the **Customer_Billing_2013_View**

In [20]:
%%sql

CREATE VIEW Customer_Billing_2013_View AS
SELECT c.LastName, SUM(i.Total), strftime('%Y', InvoiceDate) Year
FROM Customers c
INNER JOIN Invoices AS i
ON c.CustomerId = i.CustomerId
WHERE [Year] = '2013'

GROUP BY c.LastName

 * sqlite:///data/chinook.db
Done.

[]

Displaying the contents of the **Customer_Billing_2013_View**

In [21]:
%%sql

SELECT *
FROM Customer_Billing_2013_View

 * sqlite:///data/chinook.db
Done.

[('Almeida', 11.879999999999999, '2013'),
 ('Barnett', 0.99, '2013'),
 ('Bernard', 22.77, '2013'),
 ('Brooks', 22.77, '2013'),
 ('Brown', 11.879999999999999, '2013'),
 ('Chase', 1.98, '2013'),
 ('Cunningham', 8.91, '2013'),
 ('Dubois', 6.930000000000001, '2013'),
 ('Francis', 8.91, '2013'),
 ('Girard', 1.98, '2013'),
 ('Gonçalves', 8.91, '2013'),
 ('Gordon', 1.98, '2013'),
 ('Gray', 15.84, '2013'),
 ('Gruber', 0.99, '2013'),
 ('Gutiérrez', 24.75, '2013'),
 ('Hansen', 1.98, '2013'),
 ('Harris', 9.9, '2013'),
 ('Holý', 27.84, '2013'),
 ('Hughes', 0.99, '2013'),
 ('Hämäläinen', 15.84, '2013'),
 ('Jones', 15.84, '2013'),
 ('Kovács', 0.99, '2013'),
 ('Leacock', 8.91, '2013'),
 ('Mancini', 8.91, '2013'),
 ('Martins', 15.84, '2013'),
 ('Mercier', 8.91, '2013'),
 ('Miller', 6.930000000000001, '2013'),
 ('Mitchell', 0.99, '2013'),
 ('Murray', 11.879999999999999, '2013'),
 ('Muñoz', 11.879999999999999, '2013'),
 ('Nielsen', 8.91, '2013'),
 ("O'Reilly", 5.9399999999999995, '2013'),
 ('Pareek', 11.89, '2013'),
 ('Peeters', 5.9399999999999995, '2013'),
 ('Philips', 15.84, '2013'),
 ('Ralston', 0.99, '2013'),
 ('Rocha', 0.99, '2013'),
 ('Sampaio', 24.75, '2013'),
 ('Silk', 15.84, '2013'),
 ('Stevens', 5.9399999999999995, '2013'),
 ('Sullivan', 11.879999999999999, '2013'),
 ('Tremblay', 6.930000000000001, '2013'),
 ('Van der Berg', 15.84, '2013'),
 ('Wichterlová', 8.91, '2013'),
 ('Wójcik', 0.99, '2013'),
 ('Zimmermann', 9.9, '2013')]

Dropping the created **Customer_Billing_2013_View**

In [22]:
%%sql

DROP VIEW Customer_Billing_2013_View

 * sqlite:///data/chinook.db
Done.

[]